{"meta":{"title":"Ques","subtitle":null,"description":null,"author":"Jacques Yip","url":"http://blog.ques.fun","root":"/"},"pages":[{"title":"404 Not Found：该页无法显示","date":"2020-03-20T04:01:33.750Z","updated":"2020-03-20T04:01:33.750Z","comments":false,"path":"/404.html","permalink":"http://blog.ques.fun//404.html","excerpt":"","text":""},{"title":"关于","date":"2020-03-20T04:01:33.754Z","updated":"2020-03-20T04:01:33.754Z","comments":false,"path":"about/index.html","permalink":"http://blog.ques.fun/about/index.html","excerpt":"","text":"个人详细介绍"},{"title":"分类","date":"2020-03-20T04:01:33.754Z","updated":"2020-03-20T04:01:33.754Z","comments":false,"path":"categories/index.html","permalink":"http://blog.ques.fun/categories/index.html","excerpt":"","text":""},{"title":"书单","date":"2020-03-20T04:01:33.754Z","updated":"2020-03-20T04:01:33.754Z","comments":false,"path":"books/index.html","permalink":"http://blog.ques.fun/books/index.html","excerpt":"","text":""},{"title":"友情链接","date":"2020-03-20T04:01:33.754Z","updated":"2020-03-20T04:01:33.754Z","comments":true,"path":"links/index.html","permalink":"http://blog.ques.fun/links/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2020-03-20T04:01:33.754Z","updated":"2020-03-20T04:01:33.754Z","comments":false,"path":"repository/index.html","permalink":"http://blog.ques.fun/repository/index.html","excerpt":"","text":""},{"title":"标签","date":"2020-03-20T04:01:33.754Z","updated":"2020-03-20T04:01:33.754Z","comments":false,"path":"tags/index.html","permalink":"http://blog.ques.fun/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"FLOW | 我们可能都选错了时间","slug":"flow-07","date":"2019-03-05T10:00:00.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/03/05/flow-07/","link":"","permalink":"http://blog.ques.fun/2019/03/05/flow-07/","excerpt":"","text":"事倍功半的原因时间管理的三个核心：「时间」「精力」「专注」。我们都在探寻合适的方法，令自己能够把握时间、分配精力、保持专注，以达到「提高生产力」的目的。 上一期讲的是「如何了解自己的时间」，则是要去掌握第一个核心，即「时间」其本身，你对自己的时间有一定的认识了嘛？重新回顾自己的计时记录，会有一些奇怪的现象，令人十分苦恼： 原本想在早上解决简单的任务，将大project放在下午处理，但过了午休就觉得昏昏欲睡，精神萎靡；想着加一下班就能解决没有完成的工作，结果第二天不断的和睡意做斗争；规划好的时间内没办法如期完成，事情不断被延期。 显然出现这样的情况，是我们「选择错了时间」。在不对的时间做事，付出再多的时间和力气，都不一定能够获得相应的收益。 时间管理并不是简单的「罗列任务」与「填充时间轴」，还需要学会把握自己的「节奏」，找到自己哪一个时间的生产力高涨，哪一个时间低迷，「节奏」就是反映自己的「精力状态」好坏的指标，而学会把握「节奏」则是「学会如何将精力合理分配」。 生产力热力图为了能够精准记录和反映我的「精力状态」，我利用了国外大神Charlie Gilkey的「Productivity Heat Map」（生产力热力图）对自己进行精力状态跟踪，以下是我工作日其中一天的精力状态。 5格：精力旺盛、头脑清晰，做什么都高效迅速；4格：精力属于正常水平，可以较好处理工作，偶尔会觉得疲倦；3格：精力一般，有较强烈的疲劳感，需要缓解和调整；2格：情绪低迷，可能是刚起床或者准备入睡，不宜高强度工作；1格：精神萎靡，此时通常已经入睡，没睡觉也是游魂状态了。 评定的标准要以“单位时间内的产出”为衡量标准，去填充精力的格数；并且统计需要有一个周期，比如我选择跟踪统计一周时间，同时包含工作日和周末，得出一个比较吻合自己的热力图。 根据精力情况调整自己通过「生产力热力图」进一步了解自己一天的精力状态，则根据其调整自己待办任务和日程的安排，在合理的时间内选择做合理的事情。 另外，如果发现自己精力状态比较波动，也应该人为干预，调整自己去平缓过度到下一个精力状态。例如。我睡前的反常亢奋，就需要让自己安静下来，过渡到睡眠时间，以提高睡眠质量。 以下是根据我工作日的精力状态的日程规划。 早上起床（2格精力）：“开机需要一定过程”，我选择边吃早餐阅读英语，让自己适应。 刚到公司（3格精力）：精力状态一般，会先刷一遍订阅资讯和规划日程，处理工作上的一些琐碎事情； 上午工作（4格精力）：早上10点至11点，精力状态属于正常值，能够较好的投入工作，通常会安排会议，在这个时候进行讨论和敲定项目进展； 午休时间（3格精力）：我没有午休的习惯，利用这段时间折腾一下自己的爱好； 下午工作（5格精力）：下午15点至17点是我的工作精力最为旺盛的时间段，利用它研究产品绘制原型；另外下午的精力总体有一个爬升和下降的表现，所以在工作时会渐进/渐出式安排工作任务。 晚上黄金档（5格精力）：晚上20点至23点，另一个精力高峰期用于运动健身、创作写稿。 凌晨时分（3格精力）：我的一个比较特殊的地方，临睡前还有一个比较奇葩的3格精力，容易失眠，所以非特殊情况尽量让自己安静下来。 编者按了解自己的「时间构成」是客观条件，了解自己的「精力状态」是主观条件，希望能对自己有进一步的认识。我们下期见 参考来源 How Heat Mapping Your Productivity Can Make You More Productive)","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"FLOW | 你了解自己的时间吗？","slug":"flow-06","date":"2019-02-26T10:00:00.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/02/26/flow-06/","link":"","permalink":"http://blog.ques.fun/2019/02/26/flow-06/","excerpt":"","text":"分享一首歌，「时日如飞 - C Allstar」 “时日如飞”形容时间消逝得迅速。但是你真的清晰知道时间的轨迹吗？我们本期来聊聊怎么感知它。 在这个信息大爆炸的时代，学习一种时间管理的方法轻而易举，但许多人都发现各种方法在自己身上都没有取得效果。这些的症结可能在于你还没能充分了解自己的时间动态，单纯将别人的方法一成不变的复制，并不能改善你的时间管理状态。 为什么要感知时间感知时间的说白了就是「感知时间的流逝」。 在入门时间管理的时候，会误以为「时间是挤出来的」。到后来发现并不是这样的，关于“时间管理”更恰当的表述应该是：「时间是用出来的」，它是一门讨论如何利用时间的课题。 想要利用好时间，那么先要尝试去感知时间，通过工具来记录时间的流逝，再从中观察到我们自己曾经是如何“选择”和“行动”。这一个过程能够改变“挤时间”的主观意识，同时能够找到更符合自己行为轨迹的时间管理方法。 选择适合自己的计时方法感知时间最直接的方法是「记录时间」，因此我分享我曾经使用过的三种记录时间的方法：项目型计时、时间块计时、番茄钟计时 项目型计时这是最科学、最严谨的计时方法。将生活中的每一件事情所消耗的时间记录下来，也是我一开始选择的方法。在“SwipeTimes”的「Project＆Tasks」模块下，建立自己进行中的「Project」（项目），点击首页的项目即可以开始，当事情完成后再按下「结束」按钮完成记录。 进一步利用上“Tasks”功能。例如在记录每日三餐、洗漱的一些日常事项的时候，为「Personal」中添加多个「Task」，当点击该项目的时候，自动展开供你选择「Task」，可以方便快速的记录到每一个事情所耗费的时间。 适用人群：想细致了解自己时间消耗的时间管理入门者，以及工作内容经常与项目打交道的职场人。 时间块计时时间块（Time Block）计时，其实是一种最原始的计时方式，我们的课程表就是一个典型的例子，直接按照时间顺序去记录每一件事情，上一期的「日历日记」也有异曲同工之妙。 为了更高效记录和查看结果，我会选择使用「Chronodex」（时间块图）来记录。Chronodex有个好处就是将一天24小时浓缩在一个玫瑰饼图上，根据人的朝出晚归的习惯划分为三圈，每个刻度15分钟： 内圈：凌晨00:00至早上09:00 中圈：早上9:00至晚上9:00 外圈：晚上9:00至凌晨00:00 只需要将相应时间段用色条填充，附上事情的内容即完成记录，判断一天是忙还是空闲，一眼直观就能看出来。 适用人群：适合在校学生和工作内容统一划一的白领一族，Chronodex则非常适合手账爱好者。 番茄钟计时利用番茄钟计时大概是我这种“异端”才会这么做。由于我的工作内容比较跳脱，经常有多种事情交叉处理，所以我将记录焦点放在「已被使用的时间」上，当我完成每一个待办的时候，都会记录下相应使用的🍅️数量。按照我实际情况，一组番茄25+5分钟，从早上八点至晚上11点，有11个小时可供利用，得出一天正常番茄数有22个。 待办事项 番茄 耗时 英语阅读 🍅️ 25min 写稿 🍅️🍅️🍅️ 75min 封面配图 🍅️🍅️ 50in 会员框架 🍅️🍅️🍅️ 75min 微餐助手原型 🍅️🍅️🍅️ 75min 原型会议 🍅️🍅️ 50min 健身 🍅️🍅️🍅️ 75min 合计 17/22 425min 可以看出我每天的负载在77％左右，属于中等水平，今天的时间还留有弹性空间。使用番茄钟计时，还能直观看出在哪一些事项中耗时过多，及时发现效率低的情况，以便计时调整。 适用人群：工作内容跳跃性较大的工作者 让记录时间变得有意义1.清楚自己的可被支配时间 例如，我清楚知道自己可被消耗的番茄数量为22个。通过感知时间，清楚知道自己哪一些时间可被利用，一共多长，分别分布在什么时间段。 需要注意的是，第一条就讲要清楚可被支配时间，是为了着重强调「时间是用出来的」。许多人发现时间不够用，下意识的去占用睡觉、用餐时间。这是将会开始一个“事情很多-&gt;忙不过来-&gt;睡眠不足-&gt;效率地下”的「死循环」。只有保证自己不随意挤兑不可被支配时间，在「可被支配时间」里提高效率和排除影响，才是我们管理时间的正确方式。 2.找出无意义的待办事项 回顾记录的点滴，能够找到一些被迫或被动的待办事项，它们可能对我们来说是无意义的，我们要尽可能的规避它，或者尽可能减少它们出现在待办事项的次数。 3.解决痛点需要提高效率 假如发现某件事情占用的时间过长，首先要分析待办事项可不可以进行分解；其次思考是否可以方法或工具，来提高解决事情的效率；最后还要充分考虑是否需要分配时间给自己去学习方法或掌握工具。 4.永不停息地审视与改变 当记录很长时间之后，发现自己的生活节奏已经相对固定，但管理时间的收效甚微。此时，主动地去改变，或许换个时间安排，就能让事情变得不一样。 在时间管理过程中，要不断去审视自己的成果，如果发现不尽人意，那么就要下定决心去改变。 本期APP指北本期会推荐几款记录时间的APP，大家可以根据自己实际情况选择。 Swipetimes 官网链接：Swipetimes 功能说明： 对项目型计时非常友好，界面简洁美观 免费版支持最多7个项目，足够普通人群使用 免费版有限制次数的备份至Dropbox、GoogleDrive和SD卡 Toggl) 官网链接：Toggle 功能说明： 界面美观，高颜值图表 跨平台应用，适合拥有多台设备、多个工作环境下的小伙伴 免费版不限制项目数量 可以与搭档协作，免费版限制最多5人 基于网络自动备份，但「对国内小伙伴」不太友好。 Sectograph) 官方链接：Sectograph 功能说明： 适合时间块计时方式 可以与Google Calendar整合 直观的桌面挂件，可以看出一天的时间分配 编者按记录时间只是一种表现形式，不停的回顾自己在时间长流中做过的选择和行为，不断尝试去提高自己的效率，让自己在处事时逐步变得游刃有余，才是我们去感知时间的主要目的。 突然而来的彩蛋，后台回复「惊喜」获取一份惊喜。 推荐的APP有时下载不便，提供下载链接,持续更新（密码:3dm6）","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"FLOW | 你不知道的日历五种妙用","slug":"flow-05","date":"2019-02-19T13:00:00.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/02/19/flow-05/","link":"","permalink":"http://blog.ques.fun/2019/02/19/flow-05/","excerpt":"","text":"每个人的电脑或者手机都会有日历应用，但能让它发挥作用的人却并不多。如果单纯的来记录每一天的日程、约会，那么日历就是个摆设！（上班加班单身狗的怒吼）所以，今天我们就来重新发掘一下日历的新奇用法。 用法一：课程表想必许多大学生都使用过或正在使用「超级课程表」，固然是方便，但是作为课程表，它的太多功能我们都不需要（广告、论坛、推广）。因此大学期间，我将自己的课程表放到日历里面，又能够和自己日程安排整合在一起。 为了方便管理和控制显示，我们都建议建立多个不同的日历，这里为课程表新建一个名叫「Classsheet」的日历； 通过设置「循环事件」，根据实际情况，在设置截止时间为学期末截止。另外通过在备注上可以写上任课老师、要带的教材/作业。由于前往教学楼骑单车10分钟，因此提醒时间定为提前10分钟。 123456标题：单片机原理及应用时间：2016年10月31日 08:40-10:15 每周周一 重复6次地点：曾宪梓403备注：梁坚 《新概念51单片机C语言教程》提醒：提前10分钟 用法二：管理项目/计划进度为项目新建一个名叫「Weicantimes」的日历，尝试在日历中建立「全天事件」： 12标题：离线方案与混合支付时间：2019年2月18日至2019年3月4日 全天 不重复 在「月试图」中会有近似甘特图的效果，通过调整不同项目事件的「颜色」，可以很直观的看出每一个项目时间分布情况。 用法三：记录重要节日生活中最实用莫过于与日历记录亲人朋友的生日、纪念日；甚至是天猫女王节、黑色星期五、双十一这些重要的「买买买」日子；也可以是定期缴费提醒：续网费、交房租、花呗、信用卡还款日，而我还用来提醒自己发稿日期。 123标题：发布文章-什么新鲜萝卜皮时间：2019年2月19日 每周周二提醒：每天8:00 用法四：订阅节目或比赛除了自己给日历添加事件，还可以添加现成的日历，例如：法定假期、月相、日出日落、全球科技展览时间、英雄联盟赛事、NBA赛程以及电视剧时间表。 举个例子，如果我想订阅「NBA热火」的比赛日程，那么首先我需要打开 Google Calendar，点击侧边栏「更多」点击「浏览感兴趣的日历」，在新出现的界面中找到体育板块下的「篮球 - National Basketball Association - NBA」，最后在「Houston Rockets」后面的方框里勾选上就可以了。（微软日历的在「添加日历」功能可以找到） 那如果没有提供现成的呢？我们可以自己添加网络上的日历资源，点击「通过地址添加」输入webcal链接，或者点击「导入」下载的ics文件到日历中，获得更多有趣的日历。 以下网站是一些值得订阅的日历推荐： 12345678科技：https://news.techmeme.com/160425/icalendar天文：https://www.nytimes.com/interactive/2018/science/astronomy-space-calendar.html电影：http://imdbreleases.awardspace.info/电视剧：https://www.pogdesign.co.uk/cat/任天堂游戏：webcal://kartenquelle.de/Nintendo_Switch_Releases_United_States.icsPS和XBOX游戏：http://www.thegamingreview.com/ps3-and-360-release-calendar/体育赛事/演唱会：https://www.stanza.co/其他分享：http://icalshare.com 用法五：记录自己的一天如果没有记录日记的习惯，但是又想在时间管理方面作出改变，那么可以直接通过新建时间，来记录自己的一天。 另外，我喜欢在标题前面添加「emoji」表情，不仅可以将不同类型事件作区分，同时增加日历的趣味，让自己爱上看自己的日历。 编者按日历不仅是管理日程的一个工具，同时也能通过它观察到自己的生活状态，假如你还未足够了解自己，那么尝试通过日历记录你的时间痕迹，是一个非常简单且有效的方法。本期介绍的日历妙用，是希望你能够找到有趣且合适自己的打开方式，并且发掘更多日历的用法。 下一期，我们聊聊如何感知时间，我们下周二见！](—title: FLOW | 你不知道的日历五种妙用date: 2019-02-19 18:00:00tags: - FLOW 每个人的电脑或者手机都会有日历应用，但能让它发挥作用的人却并不多。如果单纯的来记录每一天的日程、约会，那么日历就是个摆设！（上班加班单身狗的怒吼）所以，今天我们就来重新发掘一下日历的新奇用法。 用法一：课程表想必许多大学生都使用过或正在使用「超级课程表」，固然是方便，但是作为课程表，它的太多功能我们都不需要（广告、论坛、推广）。因此大学期间，我将自己的课程表放到日历里面，又能够和自己日程安排整合在一起。 为了方便管理和控制显示，我们都建议建立多个不同的日历，这里为课程表新建一个名叫「Classsheet」的日历； 通过设置「循环事件」，根据实际情况，在设置截止时间为学期末截止。另外通过在备注上可以写上任课老师、要带的教材/作业。由于前往教学楼骑单车10分钟，因此提醒时间定为提前10分钟。 123456标题：单片机原理及应用时间：2016年10月31日 08:40-10:15 每周周一 重复6次地点：曾宪梓403备注：梁坚 《新概念51单片机C语言教程》提醒：提前10分钟 用法二：管理项目/计划进度为项目新建一个名叫「Weicantimes」的日历，尝试在日历中建立「全天事件」： 12标题：离线方案与混合支付时间：2019年2月18日至2019年3月4日 全天 不重复 在「月试图」中会有近似甘特图的效果，通过调整不同项目事件的「颜色」，可以很直观的看出每一个项目时间分布情况。 用法三：记录重要节日生活中最实用莫过于与日历记录亲人朋友的生日、纪念日；甚至是天猫女王节、黑色星期五、双十一这些重要的「买买买」日子；也可以是定期缴费提醒：续网费、交房租、花呗、信用卡还款日，而我还用来提醒自己发稿日期。 123标题：发布文章-什么新鲜萝卜皮时间：2019年2月19日 每周周二提醒：每天8:00 用法四：订阅节目或比赛除了自己给日历添加事件，还可以添加现成的日历，例如：法定假期、月相、日出日落、全球科技展览时间、英雄联盟赛事、NBA赛程以及电视剧时间表。 举个例子，如果我想订阅「NBA热火」的比赛日程，那么首先我需要打开 Google Calendar，点击侧边栏「更多」点击「浏览感兴趣的日历」，在新出现的界面中找到体育板块下的「篮球 - National Basketball Association - NBA」，最后在「Houston Rockets」后面的方框里勾选上就可以了。（微软日历的在「添加日历」功能可以找到） 那如果没有提供现成的呢？我们可以自己添加网络上的日历资源，点击「通过地址添加」输入webcal链接，或者点击「导入」下载的ics文件到日历中，获得更多有趣的日历。 以下网站是一些值得订阅的日历推荐： 12345678科技：https://news.techmeme.com/160425/icalendar天文：https://www.nytimes.com/interactive/2018/science/astronomy-space-calendar.html电影：http://imdbreleases.awardspace.info/电视剧：https://www.pogdesign.co.uk/cat/任天堂游戏：webcal://kartenquelle.de/Nintendo_Switch_Releases_United_States.icsPS和XBOX游戏：http://www.thegamingreview.com/ps3-and-360-release-calendar/体育赛事/演唱会：https://www.stanza.co/其他分享：http://icalshare.com 用法五：记录自己的一天如果没有记录日记的习惯，但是又想在时间管理方面作出改变，那么可以直接通过新建时间，来记录自己的一天。 另外，我喜欢在标题前面添加「emoji」表情，不仅可以将不同类型事件作区分，同时增加日历的趣味，让自己爱上看自己的日历。 本期APP指北本期,我从大平台、手机自带、独立软件三个层面推荐一些不错的日历，大家可以自行试用，不多赘述。 三大平台：* Google Calendar Microsoft Outlook（PC自带日历） Apple Callendar 手机自带： 锤子日历：拟物风格，方便实用 簡易行事曆：优秀简单的原生日历（刷机党最爱） 独立软件： Time Tree：颜值高、共享型、“时间轴”日历 日历格子：用可爱的小图章来记录生活的“萌系”日历 微约日历：共享型，方便约时间的日历 编者按日历不仅是管理日程的一个工具，同时也能通过它观察到自己的生活状态，假如你还未足够了解自己，那么尝试通过日历记录你的时间痕迹，是一个非常简单且有效的方法。本期介绍的日历妙用，是希望你能够找到有趣且合适自己的打开方式，并且发掘更多日历的用法。 下一期，我们聊聊如何感知时间，我们下周二见！ 推荐的APP有时下载不便，提供下载链接,持续更新（密码:3dm6）)","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"FLOW | 你真的准备好上班了吗","slug":"flow-04","date":"2019-02-12T10:00:00.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/02/12/flow-04/","link":"","permalink":"http://blog.ques.fun/2019/02/12/flow-04/","excerpt":"","text":"很难投入工作今天已经是年初八了，大部分小伙伴要上班，学生党也快要上学了。是不是宁愿过年放假宅在家里，都不想去上班呢？那是不可能的了。 相信许多小伙伴放纵了那么多天，无论是上班一族还是学生党，一开始都容易找不到工作/学习的状态，越是逼迫自己反而越容易造成反感。怎样才可以调整自己状态，迎接新得以年工作/学习的挑战，下面这些方法可以尝试尝试。 划出「时间之盒」给时间自己做些不一样的事情。尝试每天给自己划出一到两组的时间段，时间长短可以是30min、1至2小时，将之称为「时间之盒」，这段时间无关于工作、无关于学习，不是用来参加聚会，更不是用来吃饭睡觉打豆豆。 首先，不要预先给这些「时间之盒」制定活动内容；其次，主要思路是在这段时间里和自己相处；最后，当这段时间来临时，从自己心中去选择和你日常工作/学习不一样的事情来做： 兴趣爱好：拼积木拼图、制作模型、给自己化新妆容； 运动锻炼：健身、游泳、打篮球； 生活休闲：泡一杯自己喜欢的咖啡、挑选家具、逛淘宝； 等等 但一定要注意几个基本准则： 除了不可避免的因素，「时间之盒」不应该临时被占用； 切忌给「时间之盒」设定内容，「临时起意」的选择是最好的； 控制好时间长度，时间结束则马上停下所做的事情； 所做的事情不应有强烈的负担，如不适合选择“学法语”“学编程”类事情。 划出“时间之盒”其主要目的是让自己能有喘息的机会，人并不能总是带着「任务」去做事情，尤其在工作/学习情绪不够高涨的时候，更应该预留足够的时间给自己。 学会如何科学摸鱼人每天都只有24小时，我们做的不是压榨更多时间，而是提高某一段时间的实际价值，即：注重时间「有效性」而非「长度」。我们每天的工作时间注定不可能被全部利用上，而「摸鱼」也不一定就是一件坏事。大家可以尝试通过「番茄工作法」来实现「科学摸鱼」。 番茄工作法，每一次启动，都选择一个待办任务，将「番茄时间」设为25分钟，投入到工作学习中，「休息时间」设为5分钟。如此不断重复的启动番茄，通过记录完成待办任务所消耗的番茄数量，可以评估自己的效率变化；也可以从「我已专注工作多少个番茄」、「我完成了多少个待办任务」中获得成就感。 休息时间可以根据实际情况作出调整：例如「完成x个番茄后，有一个长休息时间」、「完成一个待办任务后有一个长休息时间」等等。通过将工作时间分割成多个「番茄」，能够改善自己对上班/学习的心理状态： 通过分割时间，劳逸结合，减轻对时间流逝过长或过慢的焦虑； 促使你去主动「开始执行」，提高选择和决策意识； 每个番茄所提供成就感可以起到持续激励作用； 对任务、目标的可量化，减少心理负担 休息更应该排上日程What？休息都要安排在日程上？没错！ 在实际工作/学习的过程中，往往我们的休息时间会被各种各样的原因所影响/占用。将其排上日程，在日历上反映出来，是让你有意识的去享受休息时间，利用这段时间好好地放松自己的大脑神经，才能应对接下来更出其不意的工作任务。 另外，尝试丰富自己休息的方式，是调节自己精神状态的重要手段。并不是只有睡觉才是休息，探索更多让自己精神放松，心情愉悦的休息方式：瑜伽、冥想、散步、画画等等。 不过需要划重点的是：「睡眠不能被取代」，并且睡得早比睡得多重要。 本期APP指北本期推荐的APP有两款：一款是我入门初期使用过的「番茄土豆」；一款是来自一位读者朋友「林熊猫」安利，很适合休息时使用的优秀应用「小睡眠」。 番茄土豆 官网链接： 功能说明：该App是基于“番茄工作法”（每个番茄25分钟的工作时间和5分钟的休息时间）的时间管理工具。 新奇妙用：但是！我个人没有按上文所说的使用方法，而是利用“番茄”的计时统计效果，去改善自己对时间感知、精力分配的能力，效果出奇的好，我们可以找一期分享分享。 小睡眠 官网链接： 功能说明：白噪音应用，可以提供一个适当的环境氛围，不会过于安静也不会过于喧嚣。 新奇妙用：正如「林熊猫」所说，我也没有单纯用来帮助入睡，还可以用于冥想、瑜伽、阅读、写作等等等。我今年有收集白噪音/氛围音的原声带的想法，不知道会不会🕊️鸽🕊️，等我成功了再和大家分享。 编者按三种调整状态的方法，不仅适合有“假期综合症”的人群，平日也可以使用这些小技巧去调整自己。同样的，方法对每个人的效果不一，我的情况大概如下可作了解： 「时间之盒」是近期学习掌握到的方法，能够很好改善自己下班后的心理状态，尚未成熟运用； 「科学摸鱼」的实践流程更符合我自身情况，虽然实际处理的方式与「番茄工作法」比较更为弹性； 而由于工作内容的缘故（每天的故事来得太突然），在工作日期间安排休息日程对我来说不太实际。 下期预告，开始系统地分享自身总结形成的时间管理理论体系，先讲讲如何做好日程管理。 推荐的APP有时下载不便，提供下载链接,持续更新（密码:3dm6）","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"FLOW | 如何立FLAG不被打脸(三)——逃离“清单是摆设”的怪圈","slug":"flow-03","date":"2019-01-29T10:00:00.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/01/29/flow-03/","link":"","permalink":"http://blog.ques.fun/2019/01/29/flow-03/","excerpt":"假如你是大学生一天会有4-6节课需要上，上班族会有5-10件公事需要处理，另外还会有3-4件私事打算要做，2-3件突如其来的意外让你应接不暇，还会有许多琐碎事情：取快递、缴费、打酱油……纵观有十多件事情需要做，有不少人都会把每天要做的事情，列出一张清单做一个每日计划。此时往往会有一个很大的困扰：“每天列出来的“待办清单”常常做不到，最后真正成了“一直待办清单””。 今天我们就来聊聊：为何清单终成摆设？待办事情如此难办？这是人性的扭曲？还是道德的沦丧？","text":"假如你是大学生一天会有4-6节课需要上，上班族会有5-10件公事需要处理，另外还会有3-4件私事打算要做，2-3件突如其来的意外让你应接不暇，还会有许多琐碎事情：取快递、缴费、打酱油……纵观有十多件事情需要做，有不少人都会把每天要做的事情，列出一张清单做一个每日计划。此时往往会有一个很大的困扰：“每天列出来的“待办清单”常常做不到，最后真正成了“一直待办清单””。 今天我们就来聊聊：为何清单终成摆设？待办事情如此难办？这是人性的扭曲？还是道德的沦丧？ （如果已经了解过GTD，直接跳至经验分享及应用分享） 使用GTD来列清单接下来涉及GTD时间管理方法，但并不是照搬照抄。不是每一个人都需要完整的GTD系统，对于我（甚至大部分人）来说掌握使用20%的功能/理论，就已经有很大的收益：「收集-处理-组织-执行-回顾」。 收集我会把任何需要跟踪、记住、或者要做的事情放到 「收集箱」 中，这里我选择Microsoft TO-DO作为后续的演示范本，应用中的“任务”作为我的 「收集箱」 ： 这个 「收集箱」 可以是纸质实体（便利贴、手账），也可以是虚拟应用（便签、邮箱、印象笔记或TODO类APP）。关键在于统一输入，无论你使用那一种介质作为 「收集箱」 ，要将你接收信息全都集中到收集箱。 处理我以“一个原则 两个目标”来处理 「收集箱」 里面的事情. 一个原则是 「两分钟原则」 ：任何事情如果花的时间少于两分钟，那么马上就去执行。 两个目标是： 每次只处理一条事情，所有事情都有相应的结果 处理是为了找出真正需要聚焦的待办 流程图会更容易被理解： 「清洗」：先用“两分钟原则”对所有事情进行一次清洗。例：“开发排期确认”可以直接发信息去询问时间，马上执行。 「转移」：有些事情可以委托/转移给他人完成。例：“跟踪问题”因为有足够的现象和数据，可以直接转移给开发人员进行调查。 「延期」：一些段时间不能马上完成的事情将其延期。例：“买笔记本电脑”如果在你的规划中，但是又不能轻易处理，最适合延期。 「删除」：既不是必须，也不能处理的事情可以直接删除。例：“买房”这种高难度事情不是我这个年纪需要考虑的，直接删掉。 处理的关键在于：「快」。经过以上四步，在“收集箱”中剩下的事情，就是今天今天真正所需要「聚焦」的待办。 组织剩下需要聚焦的待办事项，不能被转移或延期、不能被删除，同样也没办法被马上执行。组织的意义就在于： 衡量这些待办是否达到处理要求，就看它是否能被放入一下两个分类： 「下一步」：对于每一个待办事项，都已经由明确出下一步行动。「项目」：一个待办需要扩充或组合多个行动，才能达到目的，此时可以将待办转化成一个项目，进一步分解出可以被执行的下一步行动。 与前文提到的 「等待」 和 「将来」 ，共同组成了GTD的四大基础分类。 执行一切的处理、组织，都是为了「执行」，前期的工作是为了“找些捷径让自己活得轻松点”，让自己尽可能少的拖延，积极的开始行动。 回顾我会每周「回顾」自己的清单，将未被处理的信息进行处理，检查“等待”和“未来”列表中的待办，回顾虽然简单枯燥，但是为了保证事情不被积压，一定要坚持下来。同时要善于在回顾中，评估自己的效率和成果，不断调整自己处理和组织待办的方法思路。 经验分享使用GTD系统最为宝贵的地方在于你组织待办事项的方法。一个好的组织方法已经成功了80%，剩下20%在于执行。也正是方法决定了你的“清单”是否沦为摆设。以下是我的一些个人经验。 学会分辨真假据了解，清单沦为摆设的原因，首当其冲是待办写的事情太难开始了。就拿例子中的“写FLOW第三期文章”来分析，常人一看，就不会开始行动。因为它没有给你提供任何实际性“下一步行动”的信息，可以定义它是一个 「假性清单」 。 假性清单往往会让你有这样的困扰： 任务很难、不确定结果，拖延不做 项目量很大，容易被打断，一直等待大片时间空闲 无法评估耗时、无法得出衡量标准 合理组织待办而组织待办事项的主要意义在于：「消除假性清单，促进事项启动」。我从实例中取三种类型的假性清单来讲讲，怎么合理组织待办。 倒推型：绘制商户后台原型 面对“绘制商户后台原型”的任务，我会问自己，绘制出原型的“上一个步骤会是什么？”，以下是我的脑回路的图示： 通过不停反复向自己追问这个问题，最终找到它的应该执行的第一步：“分析需求”，那么我就先对所有需求进行梳理。 分割型：写FLOW第三期文章 直接让我看着“写FLOW第三期文章”这个待办，我连开始写的欲望都没有。所以我把第三期推文分割成1o个步骤，作为子待办列在清单中，并且把“FLOW”作为一个项目去管理。子待办按照自己能够行动为标准来进行分割，你还可以继续拆分下去。 经过组织后会发现，项目中有可能包含下一步行动，例如：“给应用增加某个功能”的项目中，下一步行动是今天进行“部门需求讨论”，那么它既属于项目又属于下一步，在实际操作上并不方便。 而Microsoft TO-DO中提供了“我的一天”这一模块，可以将各个分类中可以今天被执行的“下一步行动”全部添加进去统一显示。 试探型：跟踪不出单问题 应用经过测试后上线，某家商家反馈不出单，其原因是不可预测的，但必须进行排查。毫无头绪的时候，人下意识不会去执行，这个时候我列出可以尝试做的事情，试探性的寻找合理的解决方法。 时间没那么重要例子中，有的任务（Learn to code）带有时间循环，并且设置了时间提醒。我实际使用上不会给待办增加时间提醒，只会增加 「截止日期」 防止逾期。不建议设置提醒更重要的原因是：时间提醒会让你感到压力更大，时间无法被掌控的感觉，容易让你产生畏惧。 这种无法被掌控，不是时间完全不受你的控制，更精确说是你无法知道哪一个时间才是 「可行的时间」 。因此在安排事情上，时间并没有那么重要，它对于我来说更多只是个「Deadline」。 以情景安排事情我们可以尝试做这样的改变： 可以理解为Time和Moment的差别： We meet at this time. We meet at this moment… 前者是“我们在这个时候见面”，后者就是“我们在此情此景见面”，后者会更有故事感（原谅我在标点符号上做了手脚）。 不可否认，人是感性动物，因此“情景”会更易被人接受。当情景正确，那此时就是「可行的时间」，一切自然水到渠成。为待办定义一个合适的情景，作为开始行动的信号，其心理暗示作用尤为有效。 例如， 「一个人」的时候适合 「思考」 推文大纲； 在 「地铁上」 通勤的时候适合来 「安排整理」 待办； 「不想操作电脑」 的时候，适合 「用笔画」 产品流程 「不想创作」 的时候，适合去 「阅读」 博客，「复制粘贴」 搜集材料 下班 「等电梯」 的时候适合用来 「看」 粤知一二 只要能描述出什么状态下适合行动，都可以作为情景标签，用WHO、WHERE、HOW替代WHEN，列举： 本期APP指北顺应这GTD火起来的各种APP太多，并且都大同小异，本期推荐从功能复杂程度推荐6款应用，温馨提示：使用较复杂的APP入门GTD比较合适： Simpletask 简单到可以为所欲为； Google Task 谷歌全家桶友好； Any.Do 界面简约，功能全面，交互友好； Microsoft TO-DO 收购自Wunderlist，支持多清单操作，支持Windows同步； TickTick 滴答清单，国产应用，更贴合实际使用场景； Todoist 功能强大，深受苹果用户的欢迎； 编者按服了自己写个GTD都能写到「此情此景」「Moment」有的没的（官方吐槽）。 因为时间管理本质上，是了解自己心理、学会与自己相处的过程，或者是与自己玩心理战的过程。归根结底在于如何通过外界手段、主动行为，让自己心情愉悦、心悦诚服。总而言之，自我管理就像和自己谈恋爱。（自身先受一万点伤害） 本期是「如何立FLAG不被打脸」的完结篇，从立下量化目标开始，学会克服拖延、激励自我，再到基于GTD理论让FLAG变得可被推动。三篇的篇幅，笨拙的文笔，肯定不能马上让你360度转变，但这不妨是你改变的一个契机，和我一起改变自己的当下状态，走出舒适圈。 接下来还会继续写更多的自我管理话题，时间管理、专注与分神、执行力、职业规划、学习工具、职场工具等等，你们更希望是先了解什么话题？下周见。 推荐的APP有时下载不便，提供下载链接,持续更新（密码:3dm6）","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"FLOW | 如何立FLAG不被打脸(二)——驴子面前的胡萝卜","slug":"flow-02","date":"2019-01-22T06:49:48.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/01/22/flow-02/","link":"","permalink":"http://blog.ques.fun/2019/01/22/flow-02/","excerpt":"我选择写自我管理这个主题，但这期稿子制作过程竟然横跨6天，赤果果地在deadline边缘试探……当然结果是我没拖更！可能说等我填坑的人都走了~我清楚认识到“自己是个有拖延症的人”，并且，在我看来拖延症也并不能药到病除，这不是要砸自家招牌？往下看自有定论。 每个人都需要胡萝卜“驴子面前的胡萝卜”是一个悲剧。正如开篇所说，我是一个关注过程的人，这是一个讨论过程的栏目，所以我偏偏要来聊聊如何给“驴子”挂根“胡萝卜”。","text":"我选择写自我管理这个主题，但这期稿子制作过程竟然横跨6天，赤果果地在deadline边缘试探……当然结果是我没拖更！可能说等我填坑的人都走了~我清楚认识到“自己是个有拖延症的人”，并且，在我看来拖延症也并不能药到病除，这不是要砸自家招牌？往下看自有定论。 每个人都需要胡萝卜“驴子面前的胡萝卜”是一个悲剧。正如开篇所说，我是一个关注过程的人，这是一个讨论过程的栏目，所以我偏偏要来聊聊如何给“驴子”挂根“胡萝卜”。 上一期，你列出的年度愿望清单，进展如何？此时会有很多理由冒出来了。 这是一种正常现象，每一个人或多或少有些惰性，生活充满着各色诱惑，要定下心来做一件事情，其难度不亚于再来次高考。因此需要用些手段去适应“拖延症”，这些手段就是“胡萝卜”——交易与激励。 学会跟自己讨价还价举个🌰️，我的今日待办： 任务一：会员模块第二期原型制作 任务二：阅读微信开发文档会员接入相关信息 任务三：下午两点召开原型会 任务四：下午三点给商家推送更新 任务五：补充以上线产品的功能需求文档 理论上，任务一的工作量大、重要程度高。我很应该打开Axure开始埋头苦干，把最紧急最重要的先完成了。但是！没有睡好觉的我不在状态，并不想用Axure画原型，我让这件事情再拖一拖。那么什么能在这一段“不在状态”的时间里实施呢？ 任务三与任务四有明确时间点限制，排除在外。原本我应该去制作与会员相关的原型，在任务二和任务五两者之间，任务二关联性更强，并且非创造性工作更容易让自己接受并且调整状态，所以选择用任务二替代原本的安排。当我神闲气定地阅读开发文档一个小时左右，由于微信会员接入相关逻辑涉及到各种会员业务，脑内浮现关于本身会员原型中业务、功能的一些想法。 接下来，只要悄悄趁身体不注意，开始画原型就好！！！咳咳，其实是你的身心已经开始进入状态的表现。 很坦白的承认每一天都有自己想拖延的事情，这个时候不应该直接放弃，更不应该强制自己马上进行。可以尝试在待办中，物色更易接受、有助调整、有关联性的任务，与自己做一个交易：“我暂时放下这一项，我去完成另一项”。 如何进行较合理的交易？ 无时间限制：没有启动时间点限制的任务比较容易替换，只要没到deadline都可以换 性质不相同：脑力vs体力、创造性vs非创造性、单一vs多元 情景不相同：使用电脑、书写、面谈、外出、会议等等 轻量易行：选择相对轻松的任务替换，降低自己“启动”时的心理压力 有关联性：选择与原本任务有关联性的任务，更容易让自己进入状态 有重度拖延症的人，往往会被拖延所带来的自责、内疚所困，而这种困扰会让人更希望去逃避，甚至拖延下一个事件，从而走进了一个循环。所以拖延并是不症结所在，自责、内疚的心理负担才是。 改变这种状态需要的是认识自己的拖延，并且适应自己的拖延，其关键在于：“拖延，但有价值”。 在想拖延的事情面前，让自己大胆地拖延，将自己的目标放在另一件更易接受事情上，并且着手“启动”去完成它，虽然原本事情没有完成，但是这一段时间并没有浪费，对于自身是有价值的。 有的人就会问，如果所有事情都被用来替代完了，我就偏偏不做那一件事情，那怎么办？相信我，如果你一天规划里其他事情都做完了，你一定心情愉悦，那何必纠结那一件事情？硬是不愉悦的原因只有一个，敬请期待下一期（在确定待办时侯走进了一个怪圈）。 学会奖励自己：游戏人生总是在心理上哄骗自己，不断去做事情，即使你有多好骗，那也是不行的。驴子面前的胡萝卜无法触及，最终以悲剧收场，而放在自己面前的“胡萝卜”则需要张驰有度。广东人话斋：一石砂糖一石💩️。 在自我管理中，最简单易懂但又最难实践的是构建“激励系统”，其难不在于设定规则，难在克制欲望。 我们先来看看如何设定规则。激励系统中，有自己的流通货币“金币”，最基本的两个规则：达成任务我们会获得“金币”，换取奖励将会花费“金币”。 例如： 任务 周期 数量 金币 一天喝八杯水 每天 八次 10 一天英语阅读 每天 一次 20 一周健身四次 每周 四次 100 交年度计划 ❎️ 一次 20 奖励 金币 溢价 重复兑换 雪糕 5 f(x)=5+x(x-1) ✔️️ 麦当当 50 f(x)=50+10(x-1) ✔️️ 买衣服 1000 ❎️ ✔️️ 买电脑 3000 ❎️ ❎️ 在不影响可行性的情况下，我增加了一些规则，让它变得更有趣： 任务与奖励可以是单次或多次； 任务设置成在指定时间内完成足够次数才算达标； 奖励兑换一次后就涨价； 当然也可以增加： 任务失败会扣除“金币”； 连续达标会获得额外奖励； …等等。 仔细对比，会发现它其实是打卡系统的一个拓展方案，增加奖励规则提升你的热情。那么为什么不把每个任务都定一个奖励？为什么需要用“金币”去兑换奖励？ 辐射不均：一对一的奖励所带来的积极影响，不能较平均辐射到任务上 收益时间过长：长期任务获得奖励的时间太长，容易导致丧失热情 设定统一衡量：设置“金币”概念是为了统一衡量任务和奖励的降至 快速调节：由统一的“金币”衡量，更便于快速调整任务/奖励的价值 如何落地才是重点学会与自己讨价还价，其实是一种与内心自我沟通的方法表现，每一位“拖延症患者”都可以尝试着去与自己沟通，正视自己的拖延，接纳它，适应它，包容它。 将实现目标、习惯养成、解决待办，与奖励相关联，能够给你一定的动力。但是，如果要将整个过程当作一种“打怪升级”的游戏，重新定义你对“解决事情”的感受，那就需要摒弃以前的惯性思维，去培养自己的意识。 可以通过合理的工具，帮助自己去搭建激励系统：一类是，娱乐向、游戏化的Habitica；另一类是，更简洁、注重流程的PlayTask。 Habitica： )) 支持平台Web、Android、iOS功能划分划分四大模块：习惯、每日任务、待办事项、奖励优点容易上手；给你最接近游戏升级的体验，随时随地可以玩起来；不足评价任务的是系统规定的经验值与金币，不能自定义； PlayTask： )) 支持平台Android、iOS功能划分由任务+奖励两大模块组成任务类型则划分成：每日、每周、普通、副本；​优点奖励可以自由定义，有较高定制性给你最接近游戏升级的体验，随时随地可以玩起来；有趣的副本任务与自建任务相比，副本任务更规范更有动力；不足副本任务还比较少；新建任务逻辑比较简约，界面比较简陋； 什么样的人适合使用激励系统？ 仓鼠型性格：有许多愿望、喜好、种草、收集癖好等 饱受拖延所带来的内疚、自责的折磨 希望获得成就感，希望给生活带来点变化 编者按我是一名实实在在的“拖延症患者”，文中提出两种主要思路去适应拖延症，避免它给生活工作带来不必要的麻烦。我享受跟自己沟通的过程，喜欢和自己讨价还价，相反，鉴于性格原因，激励系统对我的效果收效甚微，在高中了解清楚它的来龙去脉之后，它就被移出了我的流程中。自我管理的方法与流程，在每个人身上都会有不一样的效果与反应。各位如果想要尝试，一定先要全身心去实践它，再看反馈与效果，形成自己的流程是一个较为漫长的过程，不能上手一个月就觉得没有用，继而放弃了。相信你终会找到些捷径让自己活得轻松点。 开篇讲如何确定目标，本期讲如何克服拖延，下一期将会是立FLAG话题的完（划）结（重）篇（点），讨论如何处理任务本身，敬请期待。 推荐的APP有时下载不便，提供下载链接,持续更新（密码:3dm6）","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"FLOW | 如何立FLAG不被打脸(一)——新年计划的正确打开方式","slug":"flow-01","date":"2019-01-15T06:49:48.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2019/01/15/flow-01/","link":"","permalink":"http://blog.ques.fun/2019/01/15/flow-01/","excerpt":"** 问题总有解决办法 ** 我是一个喜欢借助方法和工具去解决问题的人，因此自己积累了很多关于“解决办法”的观点和经验。出来工作之后希望能把心中所想的写成文字，丰富一下自己工作之余的生活，刚好19年的开端对我来说并不是特别的轻松容易，更促使我想通过写字让自己转变一下生活状态。因此我选择来写些我所了解的：我是如何“形成”对各色各样问题的“解决方法”。","text":"** 问题总有解决办法 ** 我是一个喜欢借助方法和工具去解决问题的人，因此自己积累了很多关于“解决办法”的观点和经验。出来工作之后希望能把心中所想的写成文字，丰富一下自己工作之余的生活，刚好19年的开端对我来说并不是特别的轻松容易，更促使我想通过写字让自己转变一下生活状态。因此我选择来写些我所了解的：我是如何“形成”对各色各样问题的“解决方法”。 ** 这是一个讨论过程的栏目 ** 人会更容易聚焦在结果，以结果为导向去处理问题，但得到的“结果”，符不符合实际需求，很多时候是不得而知的。虽然同样享受结果带来的喜悦（结果是过程所带来的产物），但我会更倾向关注过程本身，体会问题在解决过程中产生的影响，这将会是一个讨论过程的栏目。而将过程中思考理解、操作步骤、组合运用各种行为，具象化到各位看官面前的，就是“流程”、“FLOW”。 来聊聊关于FLAG的两三事自我管理是一个很大的话题，这里有一个看起来很高大上的词：“自我管理”，但是，我更喜欢另一种说法：找些捷径让自己活得轻松点，找些理由让自己活得牛逼点。先从“立FLAG”开始讲起，如何科学立Flag才能不打脸？ 第一步，列清单按照惯例，立FLAG就是把要做的事情列出来，随心所欲，为所欲为： 学Python 学吉他 学游泳 坚持健身 一夜暴富 买一台笔记本电脑 成为血小板的老公 写公众号文章 可以看到，有些愿望纯属瞎想，不可能进一步细分，更加无法实现，血小板乱入什么鬼（白眼）？？ 第二步，筛选整理经过筛选整理之后就得出一份正常的清单： 学Python 学吉他 学游泳 坚持健身 一夜暴富 工作晋升 买一台笔记本电脑 成为血小板的老公 写公众号文章 （好了，收工，我们下期见！如果到此为止，打脸那是分分钟的事情） 每一个目标都是一个大事情，没有实际的标准去衡量，也没有告诉自己，下一步要做什么。接下来，需要针对不同目标来处理一下。 第三步，量化目标将目标的周期、频次、方式、预期效果都确立下来，让目标具有可行性，用可衡量的指标来确定下一步的动作。 123学习Python | 半年内 + 自学 =&gt; 一个实用项目健身 | 一年内 + 一周至少三次 =&gt; 胸肌腹肌买电脑 | 半年内 + 存钱 =&gt; LG Gram 第四步，实践、跟踪与回顾使用工具促使自己实现被量化的目标，并且跟踪与回顾。灵活使用工具帮助自己达成目标，由于目标有许多不同的类型，工具也相当的多样化： 打卡系统 清单系统 激励系统 …… 一篇文章不可能全部讲完，先从最易用、最普适的“打卡系统”讲起。 构建属于自己的打卡系统对于需要坚持、具有周期性、可以量化的目标，可以使用打卡系统来帮助自己实现目标。例如：养成早睡早起的习惯、学习一门技能一门课程、三个月存一笔巨款。可以通过将目标分解成打卡任务来处理，下面举三个栗子。 学习Python - 每周 / 定时自学的时间控制弹性是很高，但更加需要给自己设定打卡要求。由于我周一至周五白天需要工作，我选择每周六日的上午，每天花两个小时学习。一开始，选择了以《廖雪峰Python教程》为入门基础，纵览它的目录，大概划分给它三个星期的时间，将整个课程学习完成。因此我在我的谷歌日历里面，添加一个循环事件，每周六日的9:30至11:30，并且每周提醒重复三次。当然我的Python学习，不单单只有《廖雪峰Python课程》，还会学习其他相关课程，那么只需要不断重复对固定周期循环任务的处理过程即可。 “预估耗时-&gt;分割课程-&gt;新建循环事件-&gt;坚持打卡” 存一笔巨款 - 每月 / 定量为了实现换一台笔记本电脑，那么就需要在6月份前存到足够的钱，按照自己的收入，平分每个月需要大约存下1700（比实际值大，防止物价上涨），要求自己每个月往一个账户转账（支付宝、微信零钱、余额宝也是可以的），平时不使用它消费。存钱由于不像学习Python那么有规律可循，有可能当天手头紧，但是钱只会迟到，不会不到。因此我使用使用一款小众应用“曾几”（类似纪念日、计数类应用）来记录，每当我存入一笔钱，则添加依次记录。 坚持健身 - 每周 / 定次我的健身时间选择了在工作日的晚上，给自己设定目标每周起码要去三次健身房。工作有可能需要加班，因此打卡的日期会有所变动，不方便用日历来统计，我同样用“曾几”来记录我的健身次数。通过应用提示的平均间隔，提醒自己要去健身房健身。更专业的选择：如果打卡类目标很多，那么建议用打卡APP统一管理，这里推荐从酷安市场里的“习惯”应用，小巧易用，界面美观，统计数据更完整。长按“X”即可完成打卡，还能纵览自己一直以来的打卡记录。 工具只是表象，如何利用好工具、选择适合自己工具才是核心。 类型 应用 特性 日程应用 谷歌日历 时间周期固定，有规律可循，与自己行程密切关联 计数应用 曾几 与时间维度关系不强，更关注频次 打卡应用 习惯 规范的打卡选择，覆盖时间、周期、频次多维度 大家可以根据特性来选择类似的应用 编者按作为一个不务正业的机械男，选择将自我管理方法写成文章是一个不明智的选择，着手写之后发现这显然是一个大工程，给自己挖了一个大坑，开篇写新年计划仍然许多没覆盖的内容，多多包涵。大家有什么好的想法、建议，都可以多多留言，也可以分享你的方法论，看到一定回复。敬请期待下一期，FLOW | 如何立FLAG不被打脸(二)——驴子面前的胡萝卜，我会努力填坑的。 自用小Tips我之所以选择一个不存在的日历APP（谷歌日历），因为它有一个新建“目标”功能，可以满足上面两种打卡需求。能够根据你喜好的周期频次、持续时间，避开你的已有的日程（工作、开会、约会），为你自动建立“目标”。如遇突发事情，还可以延期到下一次安排（不能太放肆自己不断延期哟！） 推荐的APP有时下载不便，提供下载链接,持续更新（密码:3dm6）","categories":[],"tags":[{"name":"FLOW","slug":"FLOW","permalink":"http://blog.ques.fun/tags/FLOW/"}]},{"title":"【引导部署笔记】第一篇——多重引导启动盘规划","slug":"multiboot1","date":"2018-07-28T08:31:37.000Z","updated":"2020-03-20T04:01:33.754Z","comments":true,"path":"2018/07/28/multiboot1/","link":"","permalink":"http://blog.ques.fun/2018/07/28/multiboot1/","excerpt":"前言通常维护重装系统都是一支U盘走天涯，刷了再刷，U盘寿命有限，而且遇上身边没有电脑那就很麻烦。 因此萌生了想要做一个只要硬件不挂，就能顺利启动引导各种系统的U盘/移动硬盘。","text":"前言通常维护重装系统都是一支U盘走天涯，刷了再刷，U盘寿命有限，而且遇上身边没有电脑那就很麻烦。 因此萌生了想要做一个只要硬件不挂，就能顺利启动引导各种系统的U盘/移动硬盘。 硬件方案选择 WD绝版移动硬盘(1T):用于制作macOS Windows Linux三个平台的安装引导，以及移动系统（便携linux、PE和VHD）的多功能启动盘 U盘()：用于制作Arch Linux、Deepin、Linux Mint和Windows的四个系统的安装盘 正常运行的电脑 引导规划移动硬盘能够通过EFI引导，适用于目前市面流行的Windows、Linux、MacOS、Android x86等系统的安装与启动；U盘用作旧电脑，通过Legacy引导启动，能够启动并安装Linux Mint、Deepin、Windows7系统 EFI核心引导从丰富的引导方案中选择三大核心，分别是适用于macOS的Clover（同时还支持黑苹果的引导），Linux的Grub2，Windows原生引导，并且他们都支持EFI启动。 Clover可以搜索引导项，而且界面美观，相当适合作为主引导；如果不需要macOS，可以以Grub2作为主引导。 引导方案 Clover Grub2 Windows(Native) EFI √ √ √ Legacy √ √ ✕ 跨平台支持 √ √ ✕ 目标系统 主引导 Linux/Android/PE Windows/VHD/PE 辅助引导工具 grub2-filemanager：基于Grub2的文件管理/镜像启动工具，本身也可以作为Grub2使用，但这里用它来引导镜像更为合适。 KonBoot:绕过Windows密码工具 引导架构12345678910111213141516171819202122ESP EFI BOOT BOOTX64.efi //主引导文件通用名，任何命名为BOOTX64.efi都可以被作为主引导 CLOVER //Clover引导文件夹 CLOVERX64.eif //EFI启动文件 config.plist //Clover启动配置文件 drivers64UEFi //64位UEFI驱动 tools //驱动工具 themes //Clover主题文件夹 kexts/Other //主要驱动文件夹 GRUB //Grub2引导文件夹 grubx64.efi //EFI启动文件(x64) grub.cfg //Grub2启动配置文件 Microsoft //Windows引导文件夹 Boot bootmgfw.efi bootmgr.efi BCD zh-CN bootmgfw.efi.mui bootmgr.efi.mui","categories":[],"tags":[{"name":"折腾","slug":"折腾","permalink":"http://blog.ques.fun/tags/折腾/"}]},{"title":"Hexo部署笔记-主题部署及备份到Github","slug":"hexo2","date":"2018-07-27T02:05:21.000Z","updated":"2020-03-20T04:01:33.754Z","comments":true,"path":"2018/07/27/hexo2/","link":"","permalink":"http://blog.ques.fun/2018/07/27/hexo2/","excerpt":"本篇记录了搭建、维护本博客的过程与设置。 Hexo的一大亮点是有丰富的主题，所以本篇我们来换主题！！！ 另外一些基础的Hexo教程都没有说到Hexo源文件怎么备份，Hexo的原理是将源文件选染成静态网页，再上传到相应的托管服务，所以源文件是不会在托管目录里面，我通过Github本身来备份源文件，这样写的博文就不会丢失。","text":"本篇记录了搭建、维护本博客的过程与设置。 Hexo的一大亮点是有丰富的主题，所以本篇我们来换主题！！！ 另外一些基础的Hexo教程都没有说到Hexo源文件怎么备份，Hexo的原理是将源文件选染成静态网页，再上传到相应的托管服务，所以源文件是不会在托管目录里面，我通过Github本身来备份源文件，这样写的博文就不会丢失。 Hexo主题配置Hexo主题可以通过下面的网站获取： Hexo官方主题列表 Zhihu网友推荐 Next Yilia(以该主题为例) 获取Themes通过git可以轻松获取主题文件 1git clone https://github.com/litten/hexo-theme-yilia.git themes/yilia 但由于我希望能够备份我的所有源文件（博文和配置），因此我做了调整： 先将喜欢的主题Fork下来，这样自己就有一份仓库，可以及时更新和备份； 通过Submodle（子模块），将这一个主题仓库，再添加到我的主题文件夹中，操作如下： 1git submodule add git@github.com:&lt;用户名&gt;/&lt;仓库名&gt;.git themes/yilia 这样我针对主题中的修改和配置，可以像对自己Github仓库一样，增删改查： 12345cd themes/yilia //进入子模块目录git status //查看状态git add . //增加修改git commit -m &quot;comments&quot; //评论git push //更新到子模块所对应的仓库 注意，以上操作只针对Fork下来的主题仓库，那么用于备份Hexo的主仓库，也应该要add、commit、push的操作一次，以更新主仓库内容。 附： 1git submodule foreach git pull //在主目录下更新子模块 配置与使用Yilia修改hexo根目录下的 _config.yml ，1、启用主题；2、启用json生成所有文章索引： 123456789101112131415161718192021theme: yilia# jsonContentjsonContent: meta: false pages: false posts: title: true date: true path: true text: false raw: false content: false slug: false updated: false comments: false link: false permalink: false excerpt: false categories: false tags: true 生成所有文章的目录需要安装node组件： 1npm i hexo-generator-json-content --save 像一些图片、头像、赞赏码等素材，可以放在source文件夹中新建assets/img文件夹，通过引用/assets/img/name.jpg即可。 根据自己需要修改主题文件夹中的_config.yml的其他配置，即可以部署看到效果。 Github备份Hexo在第一篇《Hexo部署笔记-安装与部署到Github》中使用了Github仓库做了在线托管，为了实现到哪里都可以继续写博文，继续使用这一个仓库作Hexo的备份。 新建分支和初始化在Github的仓库中，新建一个hexo分支，结构如下: 123&lt;Repository&gt;├─master└─hexo 回到本地的Hexo主目录，初始化，让它成为一个可以用Git管理版本历史的文件夹： 1git init 由于hexo已经考虑到Git的备份，所以在.gitignore文件中已经跳过了一些hexo模块文件和缓存文件，hexo模块文件可以在不同电脑重新通过hexo init初始化，没必要进行备份，以下是.gitignore的内容： 1234567.DS_StoreThumbs.dbdb.json*.lognode_modules/public/.deploy*/ 关联远程仓库关联前确保已经添加了SSH-key到Github，详情可以看《Hexo部署笔记-安装与部署到Github》。 1、关联远程仓库 1git remote add origin git@github.com:&lt;用户名&gt;/&lt;仓库名&gt;.git 2、为本地新建分支hexo 1git checkout -b hexo 3、添加本地与远程分支关联 1git branch --set-upstream-to=origin/hexo hexo 4、进行获取或者备份 12345git pullgit add .git statusgit commit -m \"create backup\"git push 多说几句 主题可以使用子模块的方式参与备份，相当是将主题通过Fork的方式建立多个自己的仓库； git要记得，先拉取再推送，分支需要确认无误，不要推到master里面了。","categories":[],"tags":[{"name":"折腾","slug":"折腾","permalink":"http://blog.ques.fun/tags/折腾/"}]},{"title":"Hexo部署笔记-安装与部署到Github","slug":"hexo1","date":"2018-07-25T06:08:10.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2018/07/25/hexo1/","link":"","permalink":"http://blog.ques.fun/2018/07/25/hexo1/","excerpt":"本篇记录了搭建、维护本博客的过程与设置。第一篇介绍如何安装Hexo，并把博客部署到Github，借助Github的静态网页托管服务，建立在线博客。 环境： Ubuntu/Windows/macOS Node Git Github","text":"本篇记录了搭建、维护本博客的过程与设置。第一篇介绍如何安装Hexo，并把博客部署到Github，借助Github的静态网页托管服务，建立在线博客。 环境： Ubuntu/Windows/macOS Node Git Github 安装GitOn macOS/LinuxmacOS/Linux已经内置了Git，非常方便。只需要生成SHH-key，方便访问Github仓库即可。 One Windows这里选择以便携方式安装Git for Windows（手动添加环境变量），并且Git自带的Bash是个不错的工具，能够使用一些基础的bash命令，能够满足轻量需求。 生成与添加SSH KeyOn macOS/Linux通过命令行生成SSH Key 1ssh-keygen -t rsa -C \"邮箱地址\" On Windows使用Git for Windows里面的bash.exe可以像macOS/Linux一样操作生成ssh-key，不过添加时的操作需要注意： 12ssh-agent bashssh-add ~/.ssh/id_rsa //用于添加ssh-key文件 默认会在相应路径下生成id_rsa和id_rsa.pub两个文件，其中id_rsa是私钥，id_rsa.pub是公钥，私钥不要公开或者上传，公钥可以上传至github进行验证。 Windows：c/Users/jvcon/.ssh/id_rsa //在bash里面也同样是~/.ssh/id_rsa.pubmacOS：~/.ssh/id_rsa.pubLinux：~/.ssh/id_rsa.pub 通过cat命令可以轻松查看id_rsa.pub 1cat ~/.ssh/id_rsa/pub 打开公钥文件即可以复制，进入Github，添加SSH Key，github -&gt; settings -&gt; ssh and gpg keys -&gt; new ssh key 安装Node.jsOn macOS已经安装好homebrew的基础上，终端中输入命令行安装node。填坑安装及使用Homebrew 1brew install node On Windows同样选择以便携方式安装Node.js，给系统手动添加环境变量。 安装Hexo安装node后，使用npm安装hexo以及相应需要的组件 1npm install hexo-cli -g 使用Hexo初始化Hexo新建一个目录用于存放你的hexo博客资料，并且进行初始化。 123mkdir hexo //名字可以自定义，作为hexo的主目录cd hexo //进入到hexo主目录hexo init //在hexo目录下初始化 安装npm组件有一些组件需要安装好，才能保证Hexo正常运行 1npm install hexo-deployer-git --save 新建博文与查看由于hexo初始化会建立基础文件，开箱即用。（在忽略主题、配置情况下，可以开始攥写博文） 通过下方命令可以新建博文，在/source/_data文件夹下可以看到title.md 1hexo new “title” //新建一个标题为title的博文 生成与预览 123hexo clean //清理缓存文件hexo g //渲染成静态网页文件hexo s //打开本地服务器，通过访问http://localhost：4000可以查看效果 部署至GithubGithub本身有友好的静态网页托管服务gh-page，因此利用Github可以方便的搭建在线博客。 新建Github仓库由于我是用于个人博客，因此新建一个仓库名为&lt;用户名&gt;.github.io，Github会自动识别该仓库中的master分支，为网页托管分支。 注意：若非个人仓库，而是普通的仓库，需要使用gh-pages分支，才可以进行托管。 在Clone or Download按钮，可以获得类似下方的ssh链接，稍后会用于部署。 1git@github.com:&lt;用户名&gt;/&lt;项目名&gt;.git 配置Github部署路径修改hexo主目录下的_config.yml的deploy： 1234deploy: type: git repository: git@github.com:&lt;用户名&gt;/&lt;项目名&gt;.git //仓库ssh链接 branch: master //非个人仓库则填写gh-pages 当需要部署到Github线上时，执行下面命令即可。 12hexo ghexo d -g","categories":[],"tags":[{"name":"折腾","slug":"折腾","permalink":"http://blog.ques.fun/tags/折腾/"}]},{"title":"新的开篇","slug":"hello-world","date":"2018-07-25T03:48:46.000Z","updated":"2020-03-20T04:01:33.750Z","comments":true,"path":"2018/07/25/hello-world/","link":"","permalink":"http://blog.ques.fun/2018/07/25/hello-world/","excerpt":"这是我2018年开的博客，这是我2018年的第一篇博文。 什么时候开始写博客？追溯起我什么时候开始写博客，应该是网易博客兴起的时候，那时候QQ空间还没火，我就注册了一哥网易，并且还用PS做五毛钱特效，给自己博客定制皮肤。后来QQ空间兴起，有各种黄钻破解，自然而然又折腾起了QQ空间。至于文章的质量，网易更像是光打雷没下雨，没几篇博文，QQ空间更像是发牢骚，生活得意不如意都那里昭告天下，想想当年真实非主流。 从这里重新开始？在8102年代，可能博客已经不是主流，这时候重新捡起博客，大概是想要成为异类吧。","text":"这是我2018年开的博客，这是我2018年的第一篇博文。 什么时候开始写博客？追溯起我什么时候开始写博客，应该是网易博客兴起的时候，那时候QQ空间还没火，我就注册了一哥网易，并且还用PS做五毛钱特效，给自己博客定制皮肤。后来QQ空间兴起，有各种黄钻破解，自然而然又折腾起了QQ空间。至于文章的质量，网易更像是光打雷没下雨，没几篇博文，QQ空间更像是发牢骚，生活得意不如意都那里昭告天下，想想当年真实非主流。 从这里重新开始？在8102年代，可能博客已经不是主流，这时候重新捡起博客，大概是想要成为异类吧。 而总结一下重写博客的目的有几个： 折腾的心不止，Wordpress太重，Hexo+Github+Markdown刚刚好，跃跃欲试； 从大学毕业，思绪万千，内心躁动，能让灵魂安于一隅，在这里寻找自己、认识自己； 喜欢折腾，喜欢生活，一路上的感想或收获会有很多，希望能够记录下来； 想要成为好的产品经理，想去让自己在这一行业有所建树； 我是一个“方法论主义者”+“话痨”，有个地方来分（唠）享（嗑）一下我的方法论。 写些什么东西？ 写下自己在产品方面的见地； 记录自己折腾的各种项目； 分享和完善自己的方法论。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://blog.ques.fun/tags/随笔/"}]}]}